#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # mongodbatlas_cluster.tc_atlas_cluster will be created
  + resource "mongodbatlas_cluster" "tc_atlas_cluster" {
      + accept_data_risks_and_force_replica_set_reconfig = (known after apply)
      + auto_scaling_compute_enabled                     = (known after apply)
      + auto_scaling_compute_scale_down_enabled          = (known after apply)
      + auto_scaling_disk_gb_enabled                     = false
      + backing_provider_name                            = "AWS"
      + backup_enabled                                   = (known after apply)
      + cloud_backup                                     = (known after apply)
      + cluster_id                                       = (known after apply)
      + cluster_type                                     = (known after apply)
      + connection_strings                               = (known after apply)
      + container_id                                     = (known after apply)
      + disk_size_gb                                     = (known after apply)
      + encryption_at_rest_provider                      = (known after apply)
      + id                                               = (known after apply)
      + mongo_db_major_version                           = "5.0"
      + mongo_db_version                                 = (known after apply)
      + mongo_uri                                        = (known after apply)
      + mongo_uri_updated                                = (known after apply)
      + mongo_uri_with_options                           = (known after apply)
      + name                                             = "atlas-terraform"
      + num_shards                                       = 1
      + paused                                           = (known after apply)
      + pit_enabled                                      = (known after apply)
      + project_id                                       = "67a9eeaba3b34d08edec75bc"
      + provider_auto_scaling_compute_max_instance_size  = (known after apply)
      + provider_auto_scaling_compute_min_instance_size  = (known after apply)
      + provider_disk_iops                               = (known after apply)
      + provider_disk_type_name                          = (known after apply)
      + provider_encrypt_ebs_volume                      = (known after apply)
      + provider_encrypt_ebs_volume_flag                 = (known after apply)
      + provider_instance_size_name                      = "M0"
      + provider_name                                    = "TENANT"
      + provider_region_name                             = "US-EAST-1"
      + provider_volume_type                             = (known after apply)
      + redact_client_log_data                           = (known after apply)
      + replication_factor                               = 3
      + snapshot_backup_policy                           = (known after apply)
      + srv_address                                      = (known after apply)
      + state_name                                       = (known after apply)
      + termination_protection_enabled                   = (known after apply)
      + version_release_system                           = (known after apply)

      + advanced_configuration (known after apply)

      + bi_connector_config (known after apply)

      + replication_specs (known after apply)
    }

  # mongodbatlas_database_user.user will be created
  + resource "mongodbatlas_database_user" "user" {
      + auth_database_name = "admin"
      + aws_iam_type       = "NONE"
      + id                 = (known after apply)
      + ldap_auth_type     = "NONE"
      + oidc_auth_type     = "NONE"
      + password           = (sensitive value)
      + project_id         = "67a9eeaba3b34d08edec75bc"
      + username           = "postechuser"
      + x509_type          = "NONE"

      + roles {
          + database_name = "admin"
          + role_name     = "readWriteAnyDatabase"
        }
    }

  # mongodbatlas_project_ip_access_list.access_list will be created
  + resource "mongodbatlas_project_ip_access_list" "access_list" {
      + aws_security_group = (known after apply)
      + cidr_block         = "0.0.0.0/0"
      + comment            = (known after apply)
      + id                 = (known after apply)
      + ip_address         = (known after apply)
      + project_id         = "67a9eeaba3b34d08edec75bc"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + connection_strings = [
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @BrunaPisera, Action: `pull_request`*